Revit 2024 API
CategorySet Class
A set that can contains Category objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class CategorySet : APIObject,
	IEnumerable
Visual Basic
Public Class CategorySet _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class CategorySet : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CategorySet
See Also
CategorySet Members
Autodesk.Revit.DB Namespace